# ExporterIFC Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExporterIFC Properties
ExporterIFC Class See Also
---
The ExporterIFC type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExportAs2x2 | Identifies if the file version being exported is 2x2. |
| ExportAs2x3 | Identifies if the file version being exported is 2x3. |
| ExportBaseQuantities | Identifies if the export should include IFC standard quantities currently supported by Revit. |
| FileName | The name of the IFC file being exported. |
| FileVersion | Identifies the file version being exported. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| SpaceBoundaryLevel | Identifies the level of space boundaries being exported. |
| WallAndColumnSplitting | Identifies if division of multi-level walls and columns by levels should take place during this export. |

# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace